# parameters
nc: 15  # number of classes
depth_multiple: 0.33  # expand model depth
width_multiple: 0.5  # expand layer channels

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov4l backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3, 1]],  # 0
   [-1, 3, Dark, [128]],  # 1-P1/2
   [-1, 9, Dark, [256]],
   [-1, 9, Dark, [512]],  # 3-P2/4
   [-1, 3, Dark, [1024]],
  ]

# yolov4l head
# na = len(anchors[0])
head:
  [[-1, 1, BaseConv, [512, 1, 1]], # 11
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],
   [-1, 3, CSPLayer, [512]], # 16

   [-1, 1, BaseConv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],
   [-1, 3, CSPLayer, [256]], # 21

   [-1, 1, BaseConv, [256, 3, 2]],
   [[-1, 9], 1, Concat, [1]],  # cat
   [-1, 3, CSPLayer, [512]], # 25

   [-1, 1, BaseConv, [512, 3, 2]], # route backbone P3
   [[-1, 5], 1, Concat, [1]],  # cat
   [-1, 3, CSPLayer, [1024]], # 29

   [[12,15,18], 1, Decoupled_Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]

